package com.example.softwarescrolling

data class Person(val name: String, val surname: String, val post: String) {

    companion object{
        val persons = listOf(
            Person("Андрей","Иванов", "Программист"),
            Person("Николай","Сидоров", "Врач"),
            Person("Анастасия","Петрова", "Учитель"),
            Person("Екатерина","Курочкина", "Инженер"),
            Person("Алексей","Галактионов", "Врач"),
            Person("Леонид","Слуцкий", "Программист"),
            Person("Максим","Головин", "Врач"),
            Person("Иван","Алексеев", "Учитель"),
            Person("Владимир","Жириновский", "Инженер"),
            Person("Сергей","Игнашевич", "Инженер"),
            Person("Анна","Киняпина", "Учитель"),
            Person("Диана","Сажина", "Программист"),
            Person("Андрей","Бондарев", "Программист"),
            Person("Николай","Акинфеев", "Врач"),
            Person("Анастасия","Пьянич", "Учитель"),
            Person("Екатерина","Афанасьева", "Инженер"),
            Person("Алексей","Кисляк", "Врач"),
            Person("Леонид","Глушенков", "Программист"),
            Person("Максим","Горький", "Врач"),
            Person("Иван","Толстой", "Учитель"),
            Person("Владимир","Ленин", "Инженер"),
            Person("Сергей","Бурунов", "Инженер"),
            Person("Анна","Пушкина", "Учитель"),
            Person("Диана","Сиразетдинова", "Программист")
        )
    }
}